In [2]:
import pandas as pd

In [3]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

In [9]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [10]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)

In [11]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [18]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [27]:
names = baby_names.groupby("Name").sum()
names['Count']

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

In [32]:
names.shape[0]

17632

In [35]:
names.drop('Year', axis=1, inplace=True)

In [62]:
names_sorted = names.sort_values(by='Count', ascending=False)
names_sorted

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

In [51]:
names_sorted.index[0]

'Jacob'

In [64]:
names_sorted[names_sorted['Count'] == names_sorted['Count'].min()]

            Count
Name
Ithzel          5
Varick          5
Lavi            5
Toma            5
Tobechukwu      5
...           ...
Eniola          5
Atlantis        5
Marci           5
Simarpreet      5
Nita            5

[2578 rows x 1 columns]

In [68]:
names_sorted[names_sorted['Count'] == names_sorted['Count'].median()]

          Count
Name
Zuleima      49
Vita         49
Aziah        49
Kaedence     49
Antonina     49
...         ...
Mckynzie     49
Yoni         49
Hareem       49
Jkwon        49
Nazier       49

[66 rows x 1 columns]

In [70]:
names_sorted['Count'].std()

11006.069467890571

In [73]:
names_sorted.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000